wisteria-1c/Конфигурация/Catalogs/ШаблоныДокументовУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныДокументовУНФ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказПоставщику</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЭД</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияПоКредитамИЗаймам</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетФактураПолученный</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходСоСчета</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаданиеНаРаботу</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказПокупателя</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачислениеНалогов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСборкаЗапасов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКадровоеПеремещение</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежнаяВедомость</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходИзКассы</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеПоЯчейкам</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходнаяНакладная</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаимозачет</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетФактура</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ШаблоныДокументовУНФ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипЗнчДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнчДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;

	ДанныеОбъекта = ДанныеЗаполнения.ПолучитьОбъект();

	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнчДанныеЗаполнения);

	ЗначенияРеквизитов.Очистить();

	Для Каждого ТекРеквизит Из ДанныеЗаполнения.Ссылка.Метаданные().Реквизиты Цикл

		Если ТекРеквизит.Имя = "Автор" Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ЗначенияРеквизитов.Добавить();
		НоваяСтрока.Реквизит = ТекРеквизит.Имя;
		НоваяСтрока.Значение = ДанныеОбъекта[ТекРеквизит.Имя];
		НоваяСтрока.Использование = ЗначениеЗаполнено(НоваяСтрока.Значение);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
